# Data Reading & Writing in Pandas

In [1]:
import pandas as pd  # data analysis library
import numpy as np   # numerical analysis

In [11]:
# Reading data from a text file using relative path

df = pd.read_table('data.txt')
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [18]:
# Reading data from a text file using absolute path

df = pd.read_table('C:\\Users\\Administrator.LAB-STUDENT\\Desktop\\myDataFiles\\data.txt')
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [20]:
df = pd.read_table(r'C:\Users\Administrator.LAB-STUDENT\Desktop\myDataFiles\data.txt')
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [21]:
df = pd.read_table('C:/Users/Administrator.LAB-STUDENT/Desktop/myDataFiles/data.txt')
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [17]:
print('this is my python\'s class')

this is my python's class

In [25]:
# Reading data from a text file without headers

df = pd.read_table('data2.txt', 
                   sep=',',
                   header=None,
                  names=['Name','Score','Gender'])
df

   Name  Score Gender
0   Tom     80      M
1   Tim     85      M
2   Kim     70      M
3  Kate     90      F
4  Alex     75      F

In [26]:
# Reading data from a text file without headers

df = pd.read_csv('data2.txt', 
                   header=None,
                  names=['Name','Score','Gender'])
df

   Name  Score Gender
0   Tom     80      M
1   Tim     85      M
2   Kim     70      M
3  Kate     90      F
4  Alex     75      F

In [29]:
# Reading data from a text file without headers

df = pd.read_csv('data7.txt', 
                   header=None,
                   delimiter="$",
                  names=['Name','Score','Gender'])
df

   Name  Score Gender
0   Tom     80      M
1   Tim     85      M
2   Kim     70      M
3  Kate     90      F
4  Alex     75      F

In [31]:
# Reading data from a text file having extra information at header

df = pd.read_csv('data4.txt', skiprows=2)
df

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [33]:
# Reading data from a text file having missing values

df = pd.read_csv('data5.txt', na_values='n.a')
df

   name  score  sex
0   Tim   80.0  NaN
1   Tom    NaN  Tom
2  Kate   70.0  NaN
3   NaN   90.0    K
4   Kim   -5.0    K

In [13]:
df3=pd.read_table("Data/data4.txt",
                  sep=",", 
                  skiprows=[0,2],
                  usecols=[0,1])
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

In [14]:
df3=pd.read_table("Data/data4.txt",
                  sep=",", 
                  skiprows=[0,2],
                  usecols=[0,1],
                  nrows=3)
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70

## Writing Data

In [16]:
df.to_csv("Data/new_data.csv")